# ExportLineweightTable Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable Constructor
ExportLineweightTable Class See Also
---
Constructs a new ExportLineweightTable with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLineweightTable()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLineweightTable()
```

# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace